In [19]:
import pandas as pd

In [7]:
values = [100, 200, 300, 400, 500, 600]
values

[100, 200, 300, 400, 500, 600]

In [14]:
seriesvalue = pd.Series(data = values, index = ["a","b","c","d","e","f"])
seriesvalue

a    100
b    200
c    300
d    400
e    500
f    600
dtype: int64

# Nested List into Series

In [16]:
nestedlist = [[100,200,300],[400,500,600]]
nestedlist

[[100, 200, 300], [400, 500, 600]]

In [20]:
series = pd.Series(data=nestedlist)
series

0    [100, 200, 300]
1    [400, 500, 600]
dtype: object

In [41]:
values = [100,200,300,400,500,600]
name = ['Yogesh', 'Ravi', 'Meher', 'Vivek', 'Indrajit', 'Ashish']
indexs = ['a','b','c','d','e','f']

lol = [values, name]
df = pd.DataFrame (data = lol)

df.transpose()

     0         1
0  100    Yogesh
1  200      Ravi
2  300     Meher
3  400     Vivek
4  500  Indrajit
5  600    Ashish

In [46]:
## Creating dataframe from dictionary

Dict = {"Name" : name, "Value" : values}

df = pd.DataFrame (data = Dict)

df

       Name  Value
0    Yogesh    100
1      Ravi    200
2     Meher    300
3     Vivek    400
4  Indrajit    500
5    Ashish    600

In [61]:
## setting column name of a transpose dataframe

values = [100,200,300,400,500,600]
name = ['Yogesh', 'Ravi', 'Meher', 'Vivek', 'Indrajit', 'Ashish']
indexs = ['a','b','c','d','e','f']

ValueSir = pd.Series(values)
NameSir = pd.Series(name)

Siri = [ValueSir, NameSir]

df = pd.DataFrame (data = Siri)

df = df.transpose ()
df.columns = ['Value', 'Name']
df

  Value      Name
0   100    Yogesh
1   200      Ravi
2   300     Meher
3   400     Vivek
4   500  Indrajit
5   600    Ashish

In [64]:
##Setting index in dataframe

df = pd.DataFrame({"Name": name, "Value": values, "Id": indexs})
df.set_index("Id")

        Name  Value
Id
a     Yogesh    100
b       Ravi    200
c      Meher    300
d      Vivek    400
e   Indrajit    500
f     Ashish    600

In [67]:
values = [100,200,300,400,500,600]
name = ['Yogesh', 'Ravi', 'Meher', 'Vivek', 'Indrajit', 'Ashish']

Dict = {"Name": name, "Value": values}
Siri = pd.Series (Dict)
Siri

Name     [Yogesh, Ravi, Meher, Vivek, Indrajit, Ashish]
Value                    [100, 200, 300, 400, 500, 600]
dtype: object